app/controllers/albums_controller.rb

  def index
    @albums = Album.page(1).per(20)
---
SELECT "albums".* FROM "albums" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]

  def create
    @user = User.find(current_user.id)
    album = @user.albums.new(required_params)
    album.state = params[:state]
    album.avatar = params[:album][:file]
    puts "-----------------ad--------------#{album}"
    if album.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "albums" ("user_id", "title", "desc", "state", "created_at", "updated_at", "avatar") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 4], ["title", "Mua he cua toi"], ["desc", "Qua tuyet voi"], ["state", true], ["created_at", "2022-07-04 09:08:12.915731"], ["updated_at", "2022-07-04 09:08:12.915731"], ["avatar", nil]]