app/controllers/photos_controller.rb

  def index
      @photos = Photo.page(1).per(20)
---
SELECT "photos".* FROM "photos" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "photos"

  def create
    @user = User.find(current_user.id)
    photo = @user.photos.new(required_params)
    photo.state = params[:state]
    photo.image = params[:photo][:file]
    if photo.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "photos" ("user_id", "album_id", "title", "desc", "file", "state", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    get_photo()
    if @photo
      if params[:photo][:file]
        @photo.image = params[:photo][:file]
      end
      @photo.state = params[:state]
      @photo.title = params[:photo][:title]
      @photo.desc = params[:desc]
      if @photo.save
---
UPDATE "photos" SET "title" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["title", "Xin chao cac ban aaa"], ["updated_at", "2022-07-04 10:19:13.737864"], ["id", 4]]

  def get_photo
    @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]